app/Controllers/Agenda.php

    public function editar()
    {
        $dados = $this->request
                        ->getVar();

        $agenda_model = new AgendaModel();

        $agenda_model
                ->where('AgendaId', $dados['AgendaId'])
                ->set($dados)
                ->update();
---
UPDATE "agendas" SET "status" = 'Em_atendimento'
WHERE "agendas"."AgendaId" IN ('466')

    public function json()
{
    $agenda_model = new AgendaModel();
    $agendas = $agenda_model->findAll();
---
SELECT *
FROM "agendas"