app/Controllers/Agenda.php

SELECT *
FROM "escolas"
---
    public function Agenda()
    {
        $agendas_model = new AgendaModel();

        $status = $this->request->getGet('status');
        $periodo = $this->request->getGet('periodo');
        $mes    = $this->request->getGet('mes') ?? date('m');
        $ano    = $this->request->getGet('ano') ?? date('Y');

    $query = $agendas_model;

        if ($periodo !== 'todos') {
        $query = $query
            ->where('MONTH(Data)', $mes)
            ->where('YEAR(Data)', $ano);
    }
              if ($status) {
        $query->where('status', $status);
    }

    $agendas = $query->orderBy('Data', 'DESC')->findAll();

    $escola_model = new EscolasModel();
    $escolas = $escola_model->findAll();

INSERT INTO `agendas` (`Nomelocal`, `Data`, `Tipo`, `Descricao`, `Solicitadopor`, `Atendidopor`) VALUES ('TESTE', '2026-06-30', 'TESTE', 'TESTE', 'TESTE', 'TESTE')
---
    public function cadastrar()
    {
        $dados = $this->request
                        ->getVar();

        $agendas_model = new AgendaModel();

        $agendas_model->insert($dados);

UPDATE `agendas` SET `status` = 'concluido'
WHERE `agendas`.`AgendaId` IN ('14')
---
    public function editar()
    {
        $dados = $this->request
                        ->getVar();

        $agenda_model = new AgendaModel();

        $agenda_model
                ->where('AgendaId', $dados['AgendaId'])
                ->set($dados)
                ->update();

SELECT *
FROM `agendas`
---
    public function json()
{
    $agenda_model = new AgendaModel();
    $agendas = $agenda_model->findAll();