app/Controllers/Bancogab.php

SELECT `bancogabs`.*, `servidores`.`nome` AS `nome_servidor`, `servidores`.`ultimoNome` AS `sobrenome_servidor`, `supervisores`.`nome` AS `nome_supervisor`
FROM `bancogabs`
LEFT JOIN `servidores` ON `servidores`.`servidorID` = `bancogabs`.`servidor_id`
LEFT JOIN `supervisores` ON `supervisores`.`SupervisorId` = `bancogabs`.`supervisor_id`
ORDER BY `bancogabs`.`Data` DESC
---
    public function Bancogab()
   {

       $bancoModel = new BancogabModel();
    $status = $this->request->getGet('Status');

   $bancoModel
    ->select("
        bancogabs.*,
        servidores.nome,
        servidores.ultimoNome,
        secao.nomeSecao,
        servico.nomeServico,
        COALESCE(secao.nomeSecao, servico.nomeServico, 'Não informado') as lotacao
    ")
    ->join('servidores', 'servidores.servidorID = bancogabs.servidor_id', 'left')
    ->join('secao', 'secao.SecaoId = servidores.secao', 'left')
    ->join('servico', 'servico.ServicoId = servidores.servico', 'left');

    $data['bancogabs'] = $bancoModel->findAll();

SELECT *
FROM `servidores`
WHERE   (
`nome` LIKE '%marcio%' ESCAPE '!'
OR  `ultimoNome` LIKE '%marcio%' ESCAPE '!'
 )
 LIMIT 10
---
    public function buscarServidores(){
        $termo = $this -> request->getGet('term');

        $model = new ServidoresModel();

$result = $model
    ->groupStart()
        ->like('nome', $termo)
        ->orLike('ultimoNome', $termo)
    ->groupEnd()
    ->findAll(10);