app/Controllers/Dashboard.php

     public function index()
    {
        $visitas = new VisitasModel();
        $agenda = new AgendaModel();
        $field = new FieldsModel();

        $mesAtual = (int) date('m');
        $anoAtual = (int) date('Y');

          /*grafico tecnico
        $porTecnico = $visitas
        ->select('t.nome, COUNT(*) as total')
        ->join('tecnicos_fields t', 't.tecnico_id = agendas.tecnico_id')
        ->groupBy('t.nome')
        ->get()
        ->getResultArray();
        */
        // CHAMADOS
         $totalChamados = $agenda
->where('EXTRACT(MONTH FROM "Data") =', $mesAtual)
->where('EXTRACT(YEAR FROM "Data") =', $anoAtual)
        ->countAllResults();
        // separados por status
        $totalChamados = $agenda
->where('EXTRACT(MONTH FROM "Data") =', $mesAtual)
->where('EXTRACT(YEAR FROM "Data") =', $anoAtual)
        ->countAllResults();

    // separados por status, também filtrando pelo mês
    $abertos = $agenda
        ->where('status', 'pendente')
->where('EXTRACT(MONTH FROM "Data") =', $mesAtual)
->where('EXTRACT(YEAR FROM "Data") =', $anoAtual)
        ->countAllResults();
---
SELECT COUNT(*) AS "numrows"
FROM "agendas"
WHERE EXTRACT(MONTH FROM "Data") = 8
AND EXTRACT(YEAR FROM "Data") = 2026
SELECT COUNT(*) AS "numrows"
FROM "agendas"
WHERE "status" = 'pendente'
AND EXTRACT(MONTH FROM "Data") = 8
AND EXTRACT(YEAR FROM "Data") = 2026