app/Controllers/Emprestimos.php

SELECT DISTINCT "pertence_a", "pertence_a"
FROM "emprestimos"
WHERE "pertence_a" IS NOT NULL
AND "pertence_a" != ''
ORDER BY "pertence_a"
---

        $nomeRecebedores = $emprestimoModel->select('nome_recebedor')->distinct()->orderBy('nome_recebedor')->findColumn('nome_recebedor');
        $nomeResponsaveis = $emprestimoModel->select('nome_responsavel')->distinct()->orderBy('nome_responsavel')->findColumn('nome_responsavel');
        $nomesPertencentes = $emprestimoModel->select('pertence_a')->where('pertence_a IS NOT NULL')->where("pertence_a != ''")->distinct()->orderBy('pertence_a')->findColumn('pertence_a') ?? [];

SELECT *
FROM "setores"
---
            ];
        }

        $setoresRows = $db->table('setores')->get()->getResultArray();

SELECT *
FROM "supervisores"
ORDER BY "nome" ASC
---
        $supervisoresModel = new SupervisoresModelGab();
        $fieldsModel = new FieldsModel();

        $supervisores = $supervisoresModel->orderBy('nome', 'ASC')->findAll();