app/Controllers/Emprestimos.php

SELECT `id_kit`
FROM `kits`
ORDER BY `id_kit` ASC
SELECT *
FROM `emprestimos`
ORDER BY `data_emprestimo` DESC
SELECT *
FROM `secao`
ORDER BY `secaoID` ASC
SELECT *
FROM `servico`
ORDER BY `servicoId` ASC
SELECT *
FROM `servidores`
ORDER BY `nome` ASC
---
        }

        $db = \Config\Database::connect();
        $kits = $db->table('kits')
            ->select('id_kit')
            ->orderBy('id_kit', 'ASC')
            ->get()
            ->getResultArray();

        $emprestimosBase = $emprestimoModel->orderBy('data_emprestimo', 'DESC')->get()->getResultArray();
        $emprestimos = $builder->orderBy('data_emprestimo', 'DESC')->get()->getResultArray();
        $sessoes     = $secaoModel->orderBy('secaoID', 'ASC')->findAll();
        $servicos    = $servicoModel->orderBy('servicoId', 'ASC')->findAll();
        $servidores  = $servidoresModel->orderBy('nome', 'ASC')->findAll();

SELECT `numero_mochila`, `status_equipamento`, `data_devolucao`
FROM `emprestimos`
---
        $nomeRecebedores = $emprestimoModel->select('nome_recebedor')->distinct()->orderBy('nome_recebedor')->findColumn('nome_recebedor');
        $nomeResponsaveis = $emprestimoModel->select('nome_responsavel')->distinct()->orderBy('nome_responsavel')->findColumn('nome_responsavel');

        $emprestimosAtivos = $emprestimoModel->select('numero_mochila, status_equipamento, data_devolucao')->findAll();