app/Controllers/Equipamentos.php

SELECT *
FROM "secao"
ORDER BY "secaoID" ASC
SELECT *
FROM "servico"
ORDER BY "servicoId" ASC
---
    public function index()
    {
        $equipamentosModel = new EquipamentosModel();
        $categoriasModel = new CategoriasModel();
        $secaoModel      = new SecaoModel();
        $servicoModel    = new ServicoModel();
        $servidoresModel = new ServidoresModel();
        $supervisoresModel = new SupervisoresModelGab();
        $db              = \Config\Database::connect();

        $filtros = [
            'busca'     => trim((string) ($this->request->getGet('busca') ?? '')),
            'estado'    => trim((string) ($this->request->getGet('estado') ?? '')),
            'categoria' => trim((string) ($this->request->getGet('categoria') ?? '')),
            'sala'      => trim((string) ($this->request->getGet('sala') ?? '')),
        ];

        $todosItens = $equipamentosModel->listar();

        $temFiltro = ($filtros['busca'] !== '' || $filtros['estado'] !== '' || $filtros['categoria'] !== '' || $filtros['sala'] !== '');
        $data['itens'] = $temFiltro ? $equipamentosModel->listar($filtros) : $todosItens;
        $data['salas'] = $equipamentosModel->listarSalas();
        $data['categorias'] = $categoriasModel->listar();
        $data['filtros'] = $filtros;

        // Servidores e Supervisores para sugestões e modal de informações
        $sessoes  = $secaoModel->orderBy('secaoID', 'ASC')->findAll();
        $servicos = $servicoModel->orderBy('servicoId', 'ASC')->findAll();

SELECT *
FROM "setores"
---
            }
        }

        $setoresRows = $db->table('setores')->get()->getResultArray();

SELECT *
FROM "servidores"
ORDER BY "nome" ASC
---
            $setorNomePorId[$st['SetorId']] = $st['nome'];
        }

        $servidores = $servidoresModel->orderBy('nome', 'ASC')->findAll();

SELECT *
FROM "supervisores"
ORDER BY "nome" ASC
---
            ];
        }

        $supervisores = $supervisoresModel->orderBy('nome', 'ASC')->findAll();