app/Controllers/Ouvidoriagab.php

    public function Ouvidoriagab()
    {
    $agendas_model = new OuvidoriaModel();
    $escolaModel = new EscolasModel();

    $agendas = $agendas_model->getComEscola(); // <-- troca aqui

    $escolas = $escolaModel->findAll();
---
SELECT *
FROM `escolas`

    public function cadastrar()
    {
    $dados = $this->request->getPost();
    $dados['escola_id'] = (int) $dados['escola_id'];
    $agendas_model = new OuvidoriaModel();
    $agendas_model->insert($dados);
---
INSERT INTO `ouvidoria` (`tipo_manifestacao`, `escola_id`, `data_recebimento`, `responsavel`, `data_devolutiva`, `prazo`, `numero_Ouvidoria`) VALUES ('reclamacao', 4, '2026-05-06', 'asda', '2026-04-29', '1231', '123123')

    public function editar()
    {
    $dados = $this->request->getPost();
    $agenda_model = new OuvidoriaModel();
    $dados['escola_id'] = (int) $dados['escola_id'];
    $agenda_model->where('ouvidoria_id', $dados['ouvidoria_id'])->set($dados)->update();
---
UPDATE `ouvidoria` SET `tipo_manifestacao` = 'denuncia', `escola_id` = 5, `data_recebimento` = '', `responsavel` = '', `data_devolutiva` = '', `prazo` = '', `numero_Ouvidoria` = '', `ouvidoria_id` = '10'
WHERE `ouvidoria_id` = '10'