app/Models/CategoriasModel.php

    public function listar(): array
    {
        return $this->db->table('categorias')
            ->select(['nome'])
            ->orderBy('id_categoria', 'ASC')
            ->get()
            ->getResultArray();
---
SELECT `nome`
FROM `categorias`
ORDER BY `id_categoria` ASC

    public function exists(string $nome): bool
    {
        if ($nome === '') {
            return false;
        }

        return $this->db->table('categorias')
            ->where('nome', $nome)
            ->countAllResults() > 0;
---
SELECT COUNT(*) AS `numrows`
FROM `categorias`
WHERE `nome` = 'Individual'