app/Models/EquipamentosModel.php

SELECT `i`.`id_item`, `i`.`tipo`, `i`.`marca_modelo`, `i`.`serial`, `i`.`patrimonio`, `i`.`estado_conservacao`, COALESCE(c.nome, i.categoria) AS categoria, `i`.`andar`, `i`.`sala`, `s`.`nome_sala`, `i`.`data_registro`
FROM `itens` `i`
LEFT JOIN `categorias` `c` ON `c`.`nome` = `i`.`categoria`
LEFT JOIN `salas` `s` ON `s`.`id_sala` = `i`.`sala`
ORDER BY `i`.`id_item` DESC
---
    public function listar(): array
    {
        $builder = $this->db->table('itens i');
        $builder->select([
            'i.id_item',
            'i.tipo',
            'i.marca_modelo',
            'i.serial',
            'i.patrimonio',
            'i.estado_conservacao',
            'COALESCE(c.nome, i.categoria) AS categoria',
            'i.andar',
            'i.sala',
            's.nome_sala',
            'i.data_registro',
        ]);
        $builder->join('categorias c', 'c.nome = i.categoria', 'left');
        $builder->join('salas s', 's.id_sala = i.sala', 'left');

        return $builder->orderBy('i.id_item', 'DESC')->get()->getResultArray();