app/Models/InventarioModel.php

    public function deleteKitItems(int $idKit): void
    {
        $db = $this->db;
        $builderKits = $db->table('kits');
        $kitRecord = $builderKits->where('id_kit', $idKit)->get()->getRowArray();

        if (!$kitRecord) {
            return;
        }

        $db->transStart();

        $itemIdsToRemove = [];
        foreach (['id_notebook', 'id_mouse', 'id_carregador', 'id_adaptador', 'id_locker'] as $field) {
            $itemId = $kitRecord[$field] ?? null;
            if (!empty($itemId)) {
                $itemIdsToRemove[] = (int) $itemId;
            }
        }

        if (!empty($itemIdsToRemove)) {
            $db->table('itens')->whereIn('id_item', array_unique($itemIdsToRemove))->delete();
---
DELETE FROM `itens`
WHERE `id_item` IN (30,31,32)