app/Models/OuvidoriaModel.php

SELECT `o`.*, `e`.`Nome`
FROM `ouvidoria` `o`
JOIN `escolas` `e` ON `e`.`EscolaId` = `o`.`escola_id`
---
    public function getComEscola()
{
    return $this->db->table('ouvidoria o')
        ->select('o.*, e.Nome')
        ->join('escolas e', 'e.EscolaId = o.escola_id')
        ->get()
        ->getResultArray();